app/views/posts/partials/_forside_blog_foto_1.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = ? LIMIT 1  [["id", 1]]
---
	</div> <!-- topline -->
	<div class="date_time"><%= post.created_at.strftime("%d.%m.%y - %H:%M") %> - <span class="author"><%= User.find(post.user_id).blogname rescue 'Salon Direct' %></span></div>