app/controllers/viewer_controller.rb

SELECT `pages`.* FROM `pages` WHERE `pages`.`name` = 'Forside' LIMIT 1
SELECT `posts`.* FROM `posts` WHERE (active) ORDER BY created_at DESC LIMIT 10
---
  def forside

    #@page = Page.find_by_name(params[:name])
     @page = Page.find_by_name('Forside')

    @pagetitle = @page.title rescue 'Indhold følger snarest'
    @content = @page.body rescue 'Indhold følger snarest'
    @headline = @page.headline rescue 'Indhold følger snarest'
    @posts = Post.forside_blogs_active.all(:limit => 10)